{
  "homepage": [
    { "title": "Phishing", "text": "Phishing is a cybercrime that uses deceptive communications to trick people into revealing sensitive personal or financial information. Posing as a trustworthy individual or organization, scammers attempt to steal data such as passwords, account numbers, and credit card details.", "image": "images/home1.jpg" },
    { "title": "Ransomware", "text": "Ransomware is a type of malicious software (malware) that encrypts a victim's files, systems, or entire network and demands a ransom payment in exchange for a decryption key. It has evolved into a major cybersecurity threat, costing organizations millions of dollars in damages, not including the ransom payments.", "image": "images/home2.jpg" },
    { "title": "DDoS", "text": "A distributed denial-of-service (DDoS) attack is a malicious attempt to disrupt the normal traffic of a targeted server, service, or network by overwhelming it with a flood of internet traffic. Unlike a basic denial-of-service (DoS) attack, which uses a single connection, a DDoS attack launches traffic from multiple compromised computer systems, making it significantly harder to stop.", "image": "images/home3.jpg" },
    { "title": "Virus", "text": "A computer virus is a malicious software program, or a type of malware, that infects a computer without the user's knowledge or permission. Like a biological virus, it can self-replicate and spread to other files, systems, and networks, causing damage to data and disrupting system operations.", "image": "images/home4.jpg" },
    { "title": "Spy-Ware", "text": "Spyware is a form of malicious software (malware) that secretly monitors and collects your personal information and activity, and then sends that data to a third party. Unlike a computer virus, spyware is not designed to replicate itself, but it can cause significant damage to your privacy, finances, and device performance.", "image": "images/home5.jpg" },
    { "title": "SQL Injection", "text": "SQL injection (SQLi) is a code injection technique used to exploit security vulnerabilities in data-driven applications. Attackers insert malicious SQL statements into an entry field to execute unauthorized database commands. If successful, SQLi can allow attackers to access, modify, or delete sensitive data, bypass authentication, and, in some cases, gain administrative access to a server.", "image": "images/home6.jpg" }
  ],
  "gallery": [
    { "title": "Spam Filter", "text": "An email spam filter is a security solution that automatically identifies and blocks unwanted or malicious emails before they reach your inbox by analyzing content, sender reputation, and technical headers.", "image": "images/gallery1.jpg" },
    { "title": "Data Backup", "text": "Data backup is the process of creating copies of data and storing them in a secondary location to protect against loss from accidents, hardware failure, or cyberattacks.", "image": "images/gallery2.jpg" },
    { "title": "Increase Bandwidth", "text": "Provisioning more bandwidth than you typically need helps your network absorb minor traffic spikes without service disruption.", "image": "images/gallery3.jpg" },
    { "title": "Antivirus", "text": "An email spam filter is a security solution that automatically identifies and blocks unwanted or malicious emails before they reach your inbox by analyzing content, sender reputation, and technical headers", "image": "images/gallery4.jpg" },
    { "title": "Firewall", "text": "A firewall acts as a security barrier, monitoring and controlling incoming and outgoing network traffic based on predetermined security rules to block unauthorized access and malicious threats.", "image": "images/gallery5.jpg" },
    { "title": "Use prepared statements", "text": "This is the best defense for SQLi. Instead of directly concatenating user input into a SQL string, you define the SQL query structure with placeholders. The database then compiles this query and handles the user data as a separate, distinct input, preventing it from being executed as code.", "image": "images/gallery6.jpg" }
  ]
}
